# Brewfile for automated dotfiles setup
# Usage: brew bundle --file=~/dotfiles/Brewfile

# Taps
tap "koekeishiya/formulae"

# Core Development Tools
brew "git"
brew "node"
brew "nvm"

# Terminal & Shell
brew "tmux"
brew "bash"
brew "bash-completion@2"

# Python (for browser-use and scripts)
brew "python@3.12"
brew "uv"                 # Fast Python package manager

# Window Management
brew "yabai"
brew "skhd"

# Git Tools
brew "gh"              # GitHub CLI
brew "git-delta"       # Better git diff
brew "lazygit"         # Terminal UI for git
brew "tig"             # Text-mode interface for git

# System Monitoring
brew "htop"
brew "btop"
brew "neofetch"

# Editor
brew "neovim"

# Nice-to-have CLI Tools
brew "tree"            # Directory visualization
brew "wget"            # File downloads
brew "jq"              # JSON processor
brew "fzf"             # Fuzzy finder

# Casks (GUI Applications)
cask "karabiner-elements"             # Keyboard customization (Caps ↔ Esc, Cmd+HJKL navigation)
cask "scroll-reverser"                # Reverse scroll direction for natural scrolling
cask "font-jetbrains-mono-nerd-font"  # Good terminal font with icons
cask "font-fira-code-nerd-font"       # Alternative nerdfont

# Browsers
cask "qutebrowser"                    # Vim-native keyboard-driven browser
cask "ghostty"                        # GPU-accelerated terminal

# Optional but useful
# cask "visual-studio-code"
# cask "docker"
# cask "iterm2"

# Browser Note: qutebrowser has vim bindings built-in, no extensions needed
# For fallback browsers (Firefox, etc.), install Tridactyl:
# - Firefox: https://addons.mozilla.org/en-US/firefox/addon/tridactyl-vim/
